# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary

In [38]:
#%pip install matplotlib inline
#%pip install seaborn

In [39]:
import numpy as np

import warnings
warnings.simplefilter('ignore')

import matplotlib.pyplot as plt
import seaborn as sns

import pandas as pd
pd.set_option('display.max_columns', None)

# Challenge 1

#### Open the ` Employee.csv` file and name your dataset `employee`

In [40]:
employee=pd.read_csv('../data/Employee.csv')
employee

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### What's the mean salary by department. 
##### Tip : There are 2 ways to do it - one way is with and the other way is without pivot tables. Do it both ways.

In [41]:
employee.describe().T

        count       mean        std   min   25%   50%   75%   max
Years     9.0   4.111111   2.803767   1.0   2.0   3.0   7.0   8.0
Salary    9.0  48.888889  16.541194  30.0  35.0  55.0  60.0  70.0

In [42]:
employee.groupby('Department')['Salary'].mean()

Department
HR       45.00
IT       48.75
Sales    55.00
Name: Salary, dtype: float64

In [43]:
pivot_employee_0 = employee.pivot_table(index='Department', values='Salary', aggfunc='mean')
pivot_employee_0

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title

In [44]:
pivot_employee_1 = employee.pivot_table(index='Department', values='Salary', columns='Title', aggfunc='mean')
pivot_employee_1

Title         VP  analyst  associate
Department
HR          70.0     32.5        NaN
IT          70.0     32.5       60.0
Sales        NaN      NaN       55.0

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [45]:
pivot_employee_2 = employee.pivot_table(index='Title', values='Salary', columns='Years')
pivot_employee_2

Years         1     2     3     4     7     8
Title
VP          NaN   NaN   NaN   NaN   NaN  70.0
analyst    35.0  30.0   NaN  35.0   NaN   NaN
associate   NaN  55.0  55.0   NaN  60.0   NaN

#### We want to know the information about the mean salary and number of employees in each department and for each job title

In [46]:
pivot_employee_3 = employee.pivot_table(index='Department', values=['Salary', 'Name'], columns='Title', aggfunc={'Salary': "mean", 'Name': "count"})
pivot_employee_3

           Name                   Salary
Title        VP analyst associate     VP analyst associate
Department
HR          1.0     2.0       NaN   70.0    32.5       NaN
IT          1.0     2.0       1.0   70.0    32.5      60.0
Sales       NaN     NaN       2.0    NaN     NaN      55.0

#### We want to know for each department and for each job title the Salary's median,minimum,maximum and standard deviation. Comment your results

In [47]:
pivot_employee_4_1 = employee.pivot_table(index='Department', values='Salary', columns='Title', aggfunc={'Salary': ["median", "min", "max", "std"]})
pivot_employee_4_1

             max                   median                     min          \
Title         VP analyst associate     VP analyst associate    VP analyst
Department
HR          70.0    35.0       NaN   70.0    32.5       NaN  70.0    30.0
IT          70.0    35.0      60.0   70.0    32.5      60.0  70.0    30.0
Sales        NaN     NaN      55.0    NaN     NaN      55.0   NaN     NaN

                           std
Title      associate   analyst associate
Department
HR               NaN  3.535534       NaN
IT              60.0  3.535534       NaN
Sales           55.0       NaN       0.0

#### Based on your comments, fill the missing values with an appropriate value

In [48]:
# no hay desviacion porque son iguales, los que dan nulos

pivot_employee_4_2 = employee.pivot_table(index='Department', values='Salary', columns='Title', aggfunc={'Salary': ["median", "min", "max", "std"]}, fill_value= 0)
pivot_employee_4_2

           max                   median                   min          \
Title       VP analyst associate     VP analyst associate  VP analyst
Department
HR          70      35         0   70.0    32.5       0.0  70      30
IT          70      35        60   70.0    32.5      60.0  70      30
Sales        0       0        55    0.0     0.0      55.0   0       0

                      std
Title      associate   VP   analyst associate
Department
HR                 0  0.0  3.535534       0.0
IT                60  0.0  3.535534       0.0
Sales             55  0.0  0.000000       0.0

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [49]:
pivot_employee_5 = employee.pivot_table(index='Department', values= ['Name', 'Salary'], aggfunc={'Name': "count", 'Salary': 'sum'})
pivot_employee_5

            Name  Salary
Department
HR             3     135
IT             4     195
Sales          2     110

#### For each Department and Title, we want to know the the total years of work experience and the mean salary

In [50]:
pivot_employee_6 = employee.pivot_table(index='Department', values=['Years', 'Salary'], columns='Title', aggfunc={'Years': 'sum', 'Salary': 'mean'})
pivot_employee_6

           Salary                   Years
Title          VP analyst associate    VP analyst associate
Department
HR           70.0    32.5       NaN   8.0     6.0       NaN
IT           70.0    32.5      60.0   8.0     3.0       7.0
Sales         NaN     NaN      55.0   NaN     NaN       5.0

#### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table

#### * Hint: Write a custom function*

In [51]:
# your answer here

In [52]:
# your answer here

# Challenge 2

#### Open the ` Fitbit.csv` file and name your dataset `fitbit`

In [53]:
fitbit=pd.read_csv('../data/Fitbit.csv')
fitbit

,Date,Calorie burned,Steps,Distance,Floors,Minutes Sedentary,Minutes Lightly Active,Minutes Fairly Active,Minutes Very Active,Activity Calories,MinutesOfSleep,MinutesOfBeingAwake,NumberOfAwakings,LengthOfRestInMinutes
0,08-05-2015,1934,905,0.65,0,1.355,46,0,0,1680,384,26,23,417
1,09-05-2015,3631,18925,14.11,4,611.000,316,61,60,2248,454,35,21,491
2,10-05-2015,3204,14228,10.57,1,602.000,226,14,77,1719,387,46,25,436
3,11-05-2015,2673,6756,5.02,8,749.000,190,23,4,9620,311,31,21,350
4,12-05-2015,2495,502,3.73,1,876.000,171,0,0,7360,407,65,44,491
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
362,03-05-2016,3796,18588,14.13,16,599.000,275,49,79,236,377,33,18,410
363,04-05-2016,3525,16382,12.39,16,684.000,333,10,55,2075,406,21,8,427
364,05-05-2016,3649,21913,16.40,19,701.000,287,29,90,2249,280,35,15,315
365,06-05-2016,3539,19023,14.79,15,575.000,298,8,85,2112,370,42,22,412
366,07-05-2016,304,9526,7.08,2,564.000,370,13,10,1604,502,57,31,563

#### Explore you dataset in terms of data types and descriptive statistics
#### *Hint: Use Pandas functions from previous lectures*

In [54]:
# your answer here

In [55]:
# your answer here

#### You suspect that there must be a linear relationship between the Minutes Very Active and the Steps. Compute the correlation between these variables.

In [56]:
# your answer here

#### Use matplotlib to visually plot Minutes Very active vs Steps. 

##### Hint : import matplotlib.pyplot as plt (See previous lessons)#####
- Use plt.scatter(x=df['col_name_1'], y=df['col_name_2'])

In [57]:
# your answer here

#### What can you say about Minute Very Active and Steps? Write a comment below

In [58]:
# your comment here

#### We also suspect that there must be a linear relationship between the Minutes Sedentary and the Steps. Compute the correlation between these variables.

In [59]:
# your answer here

#### Use matplotlib to visually plot Minutes Sedentary vs Steps. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [60]:
# your answer here

In [61]:
# Your comment here

#### We also suspect that there must be a linear relationship between the MinutesOfSleep and the Steps. Compute the correlation between these variables.

In [62]:
# your answer here

#### Use matplotlib to visually plot MinutesOfSleep vs Steps. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [63]:
# your answer here

#### Select a subset of your dataset with the columns below and compute the correlation matrix. Save the results in the variable `cor_fit`
column= ['Calorie burned', 'Steps','Floors','Minutes Sedentary','Minutes Very Active', 'MinutesOfSleep']

In [64]:
# your answer here

#### Based on the result of the correlation matrix. What are the highly correlated features with the variable Steps?
*Hint: From the results above select the variable Steps and order your results in descending order (use Pandas sort_values function)*

In [65]:
# your answer here

# Challenge 3

#### Open the `Time_Grades.csv` file and name your dataset `time_grades`

In [66]:
time_grades=pd.read_csv('../data/Time_Grades.csv')
time_grades

        Name  Study time  Grade
0       Jose           4      4
1      Maria           9      7
2      David           8      9
3      Sonia          10      7
4     Samuel          20      9
5        Eva           5      3
6     Carlos          12      7
7      Pedro           6      5
8        Ana          18      9
9   Gervasio           7      3
10     Gemma           7      8
11    Alicia          11      7
12  Jonathan           2      1
13  Cristina          13      8
14     Pilar           3      2

#### Show visually the frequency distribution of the time_grades dataset.

In [67]:
# your answer here

#### Is there a correaltion between study time and Grade? Use both Pearson and Spearman correlation and comment your results.

In [68]:
# your answer

In [69]:
## your answer

#### Use matplotlib to visually plot Study time vs Grade. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [70]:
# your answer here

In [71]:
#your comment here

#### Could you explain the difference between Pearson and Spearman correlation? (see References in README.md)

In [72]:
#your comment here